---
kind: property
id: P:Autodesk.Revit.DB.Architecture.StairsRunType.IsSlanted
source: html/8585de07-e216-358a-7aff-0581c9c7d81a.htm
---
# Autodesk.Revit.DB.Architecture.StairsRunType.IsSlanted Property

True if risers will be slanted, false if they will be straight.

## Syntax (C#)
```csharp
public bool IsSlanted { get; set; }
```